# CannotPasteRoomsInNonPlanViews Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteRoomsInNonPlanViews Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
[Rooms] can only be pasted in Plan or Ceiling Plan views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteRoomsInNonPlanViews { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteRoomsInNonPlanViews As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteRoomsInNonPlanViews {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace